import fpdf


def made_PDF(ls_book, name_pdf):
    """

    :param ls_book: Список книг
    :return:
    """
    ls = [7, 35, 70, 65, 15]
    ls_k = [7, 35, 70, 65, 15]
    word_ls = []
    num = 0
    fr = 0
    cn = -1
    fl = 0
    ls3 = []
    max_ls = []
    cn3 = -1
    sch = 0

    pdf = fpdf.FPDF(format='legal')  # pdf format
    pdf.add_page()
    pdf.add_font('DejaVu_Bold', '', 'DejaVuSans-Bold.ttf', uni=True)
    pdf.set_font('DejaVu_Bold', '', 10)
    pdf.cell(7, 10, txt='#')
    pdf.cell(35, 10, txt='Автор')
    pdf.cell(70, 10, txt='Заглавие')
    pdf.cell(65, 10, txt='Издательство')
    pdf.cell(15, 10, txt='Объём', ln=1)
    pdf.cell(50, 7, txt='', ln=1)
    pdf.add_font('DejaVu', '', 'DejaVuSansCondensed.ttf', uni=True)
    pdf.set_font('DejaVu', '', 10)
    pdf.set_line_width(0.5)
    pdf.set_draw_color(0, 0, 0)
    pdf.line(11, 20, 202, 20)

    # Для исправленея ошибки переполнения списка
    if len(ls_book) > 47:
        ls_book = ls_book[:47]

    for i in ls_book:
        for j in i.items():
            if str(j[0]) == 'id':
                num += 1
                word_ls.append(str(num))
            if str(j[0]) != 'id' and str(j[0]) != '900a':
                st = j[1]
                while len(st) > 30:
                    fr += 1
                    st1 = st[:30]
                    st = st.split()
                    st1 = st1.split()
                    del st1[-1]
                    for x in range(len(st1)):
                        del st[0]
                    st1 = ' '.join(st1)
                    st = ' '.join(st)
                    if fr == 1:
                        word_ls.append([st1])
                    else:
                        word_ls[-1].append(st1)
                    fl = 1

                if j[0] == '100a' and len(st) >= 17:
                    word_ls.append(st.split(','))
                elif fl != 1:
                    word_ls.append(st)
                else:
                    word_ls[-1].append(st)
                fr = 0
                fl = 0
    for i in range(len(word_ls) + 1):
        cn += 1
        if cn == 5:
            for x in ls3:
                if type(x) == list:
                    max_ls.append(len(x))
            if len(max_ls) > 0:
                max_ch = max(max_ls) - 1
            else:
                max_ch = 0
            for j in range(max_ch):
                sch += 1
                pdf.cell(0, 5, txt='', ln=1)
                for y in ls3:
                    cn3 += 1
                    if cn3 == 5:
                        cn3 = 0
                    try:
                        if type(y) == list:
                            pdf.cell(ls_k[cn3], 2, txt=y[sch].strip())
                        else:
                            pdf.cell(ls_k[cn3], 0, txt='')
                    except:
                        cn3 = -1
                        break
            cn3 = -1
            sch = 0
            pdf.cell(0, 10, txt = '', ln = 1)
            max_ls = []
            max_ch = 0
            ls3 = []
            cn = 0
        try:
            if type(word_ls[i]) == list:
                pdf.cell(ls[cn], 3, txt=word_ls[i][0])
            else:
                pdf.cell(ls[cn], 3, txt=word_ls[i])
            ls3.append(word_ls[i])
        except:
            break

    pdf.output(name_pdf)
    return True


if __name__ == '__main__':
    dk = [{'id': 130561, '100a': ' ', '245a': 'Наука - производству', '260b': 'Сельская новь', '300a': 'C. 1',
           '900a': ''},
          {'id': 281604, '100a': 'Алексеенко, С. В.', '245a': 'Наука - это поиск и общение', '260b': 'ЭКО',
           '300a': 'С. 134-142', '900a': ''},
          {'id': 68615, '100a': 'Рубцова, Н.', '245a': 'Наука и устойчивое развитие АПК', '260b': 'Экономист',
           '300a': 'С. 89-96', '900a': ''},
          {'id': 89612, '100a': 'Ройтман, С.', '245a': 'Наука управлять наукой', '260b': 'Инновации',
           '300a': 'С. 45-48', '900a': ''}, {'id': 239639, '100a': 'Багдасарьян, Н. Г.',
                                             '245a': 'Наука как призвание и профессия: опыт современного прочтения М. Вебера',
                                             '260b': 'Вопросы философии', '300a': 'С. 174-180', '900a': ''},
          {'id': 286751, '100a': 'Никитин, А. В.',
           '245a': 'Наука и научно-технологическое развитие как факторы роста экономики региона',
           '260b': 'Достижения науки и техники АПК', '300a': 'С. 5-6', '900a': ''},
          {'id': 94755, '100a': 'Зубова, Л.', '245a': 'Наука и инновации: оценки руководителей научных организаций',
           '260b': 'Ученый совет', '300a': 'C. - 59-64', '900a': ''}, {'id': 137767, '100a': 'Ракитов, А. И.',
                                                                       '245a': 'Наука, образование и супериндустриальное общество: реалистический проект для России',
                                                                       '260b': 'Вопросы философии', '300a': 'C. 60-69',
                                                                       '900a': ''},
          {'id': 236584, '100a': 'Горбачев, И. В.', '245a': 'Наука - производству', '260b': 'Сельский механизатор',
           '300a': 'С. 32-33', '900a': ''},
          {'id': 33320, '100a': 'Фисинин В.', '245a': 'Наука и развитие отечественного птицеводства',
           '260b': 'Птицеводство', '300a': 'С.2-9', '900a': ''}, {'id': 292394, '100a': 'Солдатова, Т. Г.',
                                                                  '245a': 'Наука предлагает решение проблемы повышения плодородия почв',
                                                                  '260b': 'Сахарная свекла', '300a': 'С. 20-24',
                                                                  '900a': ''},
          {'id': 13356, '100a': 'Иванова Н.', '245a': 'Наука и инновации', '260b': 'Экономист', '300a': 'С.72-80',
           '900a': ''}, {'id': 291885, '100a': ' ', '245a': 'Наука и образование в России', '260b': 'Вузовский вестник',
                         '300a': 'С. 2', '900a': ''},
          {'id': 197165, '100a': 'Веретов, Л. А.', '245a': 'Наука и отрасль: партнерство в современных условиях',
           '260b': 'Все о мясе', '300a': 'С. 4-9', '900a': ''}, {'id': 242737, '100a': 'Тодосийчук, А.',
                                                                 '245a': 'Наука как ключевой фактор обеспечения экономической безопасности',
                                                                 '260b': 'Проблемы теории и практики управления',
                                                                 '300a': 'С. 13-27', '900a': ''},
          {'id': 241205, '100a': 'Иванов, В. В.', '245a': 'Наука и технологии как факторы геополитики',
           '260b': 'Инновации', '300a': 'С. 35-40', '900a': ''},
          {'id': 137782, '100a': 'Губарев, В. В.', '245a': 'Наука ли синергетика?', '260b': 'Вопросы философии',
           '300a': 'C. 159-165', '900a': ''}, {'id': 292408, '100a': 'Савватеева, А.', '245a': 'Наука побеждать',
                                               '260b': 'Охрана труда и социальное страхование', '300a': 'С. 79-85',
                                               '900a': ''},
          {'id': 136760, '100a': 'Аршанский, В. ', '245a': 'Наука, вперед!', '260b': 'Сельская жизнь', '300a': 'С. 2',
           '900a': ''}, {'id': 60479, '100a': 'Апасов, И. В.', '245a': 'Наука-свекловодству', '260b': 'Сахарная свекла',
                         '300a': 'С.7-8', '900a': ''},
          {'id': 140866, '100a': 'Мамут, Л. С.', '245a': 'Наука и образование в современной юриспруденции',
           '260b': 'Общественные науки и современность', '300a': 'С. 125-129', '900a': ''},
          {'id': 121922, '100a': 'Сохнова, Г.', '245a': 'Наука управлять хозяйством', '260b': 'Белгородская правда',
           '300a': 'С. 12', '900a': ''},
          {'id': 213575, '100a': 'Тимофеев, И.', '245a': 'Наука международных отношений: вернуть лидерство?',
           '260b': 'Аккредитация в образовании', '300a': 'С. 16-17', '900a': ''},
          {'id': 189006, '100a': 'Васильев, Д. Б.', '245a': 'Наука в зоопарке', '260b': 'Химия и жизнь-XXI век',
           '300a': 'С. 48-51', '900a': ''},
          {'id': 211026, '100a': ' ', '245a': 'Наука и инновации в Орловской области', '260b': ' ', '300a': '76 с',
           '900a': ''},
          {'id': 138843, '100a': 'Ермолаев, В.', '245a': 'Наука нам поможет', '260b': 'Трибуна', '300a': 'С. 1',
           '900a': ''},
          {'id': 120417, '100a': 'Комиссаренко, А. А.', '245a': 'Наука и практика ветеринарной гомеопатии',
           '260b': 'Международный вестник ветеринарии', '300a': 'С. 32-38', '900a': ''},
          {'id': 92265, '100a': 'Беляев, Г.Ю.',
           '245a': 'Наука как особая форма общественного сознания: ХХ век и перспектива',
           '260b': 'Образование и общество', '300a': 'С. 74-79', '900a': ''},
          {'id': 296554, '100a': 'Воронин, Б. А.', '245a': 'Наука - один из главных приоритетов Уральского ГАУ ',
           '260b': 'Аккредитация в образовании', '300a': 'С. 40-41', '900a': ''},
          {'id': 56430, '100a': 'Сидоров Г.Н.', '245a': 'Наука и философия о развитии жизни на Земле',
           '260b': 'Философия науки', '300a': 'С.36-63', '900a': ''},
          {'id': 248943, '100a': ' ', '245a': 'Наука - главная стратегия развития',
           '260b': 'Аккредитация в образовании', '300a': 'С. 24-26', '900a': ''},
          {'id': 222322, '100a': 'Фиговский, О. Л.',
           '245a': 'Наука за рубежом движется вперед: "вечная" флэш - память, "подводные" светильники, нанопростыня',
           '260b': 'Нанотехнологии экология производство', '300a': 'С. 58-60', '900a': ''},
          {'id': 232050, '100a': 'Козлов, В. В.',
           '245a': 'Наука и высшее образование должно стать рыночно ориентированным',
           '260b': 'Экономика сельскохозяйственных и перерабатывающих предприятий', '300a': 'С. 49-53', '900a': 'Есть'},
          {'id': 128628, '100a': 'Фейерабенд, П.', '245a': 'Наука в свободном обществе (фрагменты из книги)',
           '260b': 'Личность. Культура. Общество', '300a': 'С. 64-79; ', '900a': ''},
          {'id': 64117, '100a': ' ', '245a': 'Наука в мире', '260b': 'Химия и жизнь', '300a': 'С. 6-10', '900a': ''},
          {'id': 292468, '100a': ' ', '245a': 'Наука и инновации в Орловской области', '260b': ' ', '300a': '61 с',
           '900a': ''},
          {'id': 33907, '100a': 'Татур И.С.', '245a': 'Наука на службе производства', '260b': 'Сахарная свекла',
           '300a': 'С.10-12', '900a': ''},
          {'id': 53370, '100a': ' ', '245a': 'Наука и инновации в Орловской области (1995-2002 гг.)', '260b': ' ',
           '300a': '27с', '900a': ''},
          {'id': 158850, '100a': 'Юдин, Б. Г.', '245a': 'Наука в обществе знаний', '260b': 'Вопросы философии',
           '300a': 'С. 45-57', '900a': ''},
          {'id': 29826, '100a': ' ', '245a': 'Наука в отставке', '260b': 'ЭКО', '300a': 'С.25', '900a': ''},
          {'id': 284804, '100a': 'Гутнер, Г. Б.',
           '245a': 'Наука в контексте человеческих практик. Конструктивизм и эволюционная эпистемология о начале науки',
           '260b': 'Вопросы философии', '300a': 'С. 147-157', '900a': ''},
          {'id': 158853, '100a': 'Степин, В. С.', '245a': 'Наука и философия', '260b': 'Вопросы философии',
           '300a': 'С. 58-75', '900a': ''}, {'id': 284807, '100a': 'Антоновский, А. Ю.',
                                             '245a': 'Наука как общественная подсистема. Никлас Луман о механизмах социальной эволюции знания и истины',
                                             '260b': 'Вопросы философии', '300a': 'С. 158-171', '900a': ''},
          {'id': 227463, '100a': 'Ипполитова, А. А.',
           '245a': 'Наука, инновация, интеллектуальная собственность - основа перехода к инновационной экономике',
           '260b': 'Инновации', '300a': 'С. 66-70', '900a': ''},
          {'id': 20622, '100a': 'Анчишкин, А. И.', '245a': 'Наука-техника-экономика', '260b': 'Экономика',
           '300a': '384с', '900a': ''},
          {'id': 318611, '100a': 'Первушин, А.', '245a': 'Наука «Аполлонов»', '260b': 'Наука и жизнь',
           '300a': 'С. 34-49; ', '900a': ''},
          {'id': 264853, '100a': ' ', '245a': 'Наука - эффективный механизм роста сельской экономики',
           '260b': 'Аккредитация в образовании', '300a': 'С. 28-29', '900a': ''},
          {'id': 13356, '100a': 'Иванова Н.', '245a': 'Наука и инновации', '260b': 'Экономист', '300a': 'С.72-80',
           '900a': ''}, {'id': 291885, '100a': ' ', '245a': 'Наука и образование в России', '260b': 'Вузовский вестник',
                         '300a': 'С. 2', '900a': ''}]
    a = made_PDF(dk, 'Temp.pdf')
    print(a)
