import fpdf

def made_PDF(dk):
    ls = [30, 75, 60, 15]
    ls_k = [30, 75, 60, 15]
    word_ls = []
    fr = 0
    cn = -1
    fl = 0
    ls3 = []
    max_ls = []
    cn3 = -1
    sch = 0

    pdf = fpdf.FPDF(format='legal') #pdf format
    pdf.add_page()
    pdf.add_font('DejaVu_Bold', '', 'DejaVuSans-Bold.ttf', uni=True)
    pdf.set_font('DejaVu_Bold', '', 10)
    pdf.cell(30, 10, txt='# Автор')
    pdf.cell(75, 10, txt='Заглавие')
    pdf.cell(60, 10, txt='Издательство')
    pdf.cell(15, 10, txt='Объём', ln=1)
    pdf.cell(50, 7, txt='', ln=1)
    pdf.add_font('DejaVu', '', 'DejaVuSansCondensed.ttf', uni=True)
    pdf.set_font('DejaVu', '', 10)
    pdf.set_line_width(1)
    pdf.set_draw_color(0, 0, 0)
    pdf.line(11, 20, 190, 20)

    for i in dk:
        for j in i.items():
            if str(j[0]) != 'id' and str(j[0]) != '900a':
                st = j[1]
                while len(st) > 35:
                    fr += 1
                    st1 = st[:35]
                    st = st[35:]
                    if fr == 1:
                        word_ls.append([st1])
                    else:
                        word_ls[-1].append(st1)
                    fl = 1
                if fl != 1:
                    word_ls.append(st)
                else:
                    word_ls[-1].append(st)
                fr = 0
                fl = 0

    for i in range(len(word_ls)+1):
        cn += 1
        if cn == 4:
            for x in ls3:
                if type(x) == list:
                    max_ls.append(len(x))
            if len(max_ls) > 0:
                max_ch = max(max_ls)-1
            else:
                max_ch = 0
            for j in range(max_ch):
                sch += 1
                pdf.cell(50, 3, txt='', ln=1)
                for y in ls3:
                    cn3 += 1
                    if cn3 == 4:
                        cn3 = 0
                    try:
                        if type(y) == list:
                            pdf.cell(ls_k[cn3], 6, txt=y[sch])
                        else:
                            pdf.cell(ls_k[cn3], 3, txt='')
                    except:
                        break
            cn3 = -1
            sch = 0
            max_ch = 0
            ls3 = []
            pdf.cell(50, 9, txt='', ln=1)
            cn = 0
        try:
            if type(word_ls[i]) == str:
                pdf.cell(ls[cn], 3, txt=word_ls[i])
            else:
                pdf.cell(ls[cn], 3, txt=word_ls[i][0])
            ls3.append(word_ls[i])
        except:
            break

    return pdf.output("Table_Lt.pdf")


if __name__ == '__main__':
    dk = [{'id': 2055, '100a': 'Кэтлин, Э.', '245a': 'Программирование на языке БЕЙСИК:Версия True BASIC', '260b': 'Мир', '300a': '288с.', '900a': ''}, {'id': 3339, '100a': 'Башмакова, Е. С.', '245a': 'Программирование микроЭВМ на языке Бейсик', '260b': 'Радио и связь', '300a': '240с.', '900a': ''}, {'id': 106252, '100a': 'Антонюк, В. С.', '245a': 'Программирование производства молока', '260b': 'Ураджай', '300a': '63с', '900a': ''}, {'id': 106509, '100a': 'Куценко, А. И.', '245a': 'Программирование продуктивности на комплексах по выращиванию и откорму молодняка крупного рогатого скота', '260b': 'Известия Тимирязевской сельскохозяйственной академии', '300a': 'С. 149-151', '900a': ''}, {'id': 246414, '100a': 'Можаев, Н.И.', '245a': 'Программирование урожаев сельскохозяйственных культур [Электронный ресурс]', '260b': 'Фолиант', '300a': ' ', '900a': 'Есть'}, {'id': 74776, '100a': 'Каипов, Я.З.', '245a': 'Программирование урожаев в кормовом севообороте', '260b': 'Земледелие', '300a': 'С. 30-31', '900a': ''}, {'id': 51736, '100a': 'Саймон, Дж.', '245a': 'Программирование в Excel', '260b': 'Вильямс', '300a': '336с.', '900a': ''}, {'id': 41755, '100a': 'Наумкин В.Н.', '245a': 'Программирование урожайности озимой пшеницы в условиях Орловской области', '260b': 'Достижения науки и техники АПК', '300a': 'С.19-22', '900a': ''}, {'id': 170909, '100a': 'Смирнов, И. Г.', '245a': 'Программирование урожая при автоматизированном проектировании агротехнологий возделывания черной смородины', '260b': 'Сельскохозяйственные машины и технологии', '300a': 'С. 18-21', '900a': ''}, {'id': 226468, '100a': 'Архангельский, А. Я.', '245a': 'Программирование в Delphi', '260b': 'Бином', '300a': '816 с (115', '900a': ''}, {'id': 21284, '100a': 'Баласанян, В. Э.', '245a': 'Программирование на микроэвм"Искра 226"', '260b': 'Финансы и статистика', '300a': '264с.', '900a': ''}, {'id': 3885, '100a': 'Попов, А. А.', '245a': 'Программирование в среде СУБД FoxPro 2.0.Построение систем обработки данных', '260b': 'Радио и связь', '300a': '352с', '900a': ''}, {'id': 65456, '100a': 'Акименко, А. С.', '245a': 'Программирование продуктивности севооборотов', '260b': 'Достижения науки и техники АПК', '300a': 'С. 9-11', '900a': ''}, {'id': 22322, '100a': 'Каюмов, М. К.', '245a': 'Программирование продуктивности полевых культур', '260b': 'Росагропромиздат', '300a': '368с.', '900a': ''}, {'id': 11832, '100a': 'Дэвис, С. Р.', '245a': 'Программирование на Microsoft Visual Java++', '260b': 'Channel Trading Ltd', '300a': '376с.', '900a': ''}, {'id': 59449, '100a': 'Цой Ю.А.', '245a': 'Программирование кормопроизводства-процесс ресурсосбережения первого этапа производства молока', '260b': 'Техника в сельском хозяйстве', '300a': 'С.36-37', '900a': ''}, {'id': 98116, '100a': 'Ветрова, М. Н.', '245a': 'Программирование урожаев полевых культур и интенсивные технологии возделывания в Нечерноземье', '260b': ' ', '300a': '80с.', '900a': ''}, {'id': 98117, '100a': ' ', '245a': 'Программирование урожаев сельскохозяйственных культур', '260b': 'ВСХИ', '300a': '196с.', '900a': ''}, {'id': 98118, '100a': ' ', '245a': 'Программирование урожаев сельскохозяйственных культур', '260b': ' ', '300a': '164с.', '900a': ''}, {'id': 3911, '100a': 'Канатников, А. Н.', '245a': 'Программирование в среде Clipper.Версия 5.0 и особенности версии 5.01', '260b': 'Финансы и статистика', '300a': '240с', '900a': ''}, {'id': 102599, '100a': 'Коренев, Г. В.', '245a': 'Программирование урожайности зерновых культур в Центрально-Черноземной зоне', '260b': 'ВСХИ', '300a': '48с.', '900a': ''}, {'id': 231894, '100a': 'Васильев, А. А.', '245a': 'Программирование урожая картофеля в условиях Южного Урала', '260b': 'Достижения науки и техники АПК', '300a': 'С. 45-48', '900a': ''}, {'id': 97624, '100a': 'Каюмов, М. К.', '245a': 'Программирование урожаев сельскохозяйственных культур', '260b': 'Агропромиздат', '300a': '320с.', '900a': ''}, {'id': 36953, '100a': 'Хилайер С.', '245a': 'Программирование Active Server Pages', '260b': 'Channel Trading Ltd', '300a': ' ', '900a': ''}, {'id': 308698, '100a': 'Колесник, И. С.', '245a': 'Программирование двигательных действий квалифицированного боксера', '260b': 'Теория и практика физической культуры', '300a': 'С. 82-84', '900a': ''}, {'id': 1375, '100a': 'Воробьев В.С.', '245a': 'Программирование урожайности и качества полевых кормовых культур Нечерноземья', '260b': 'Колос.Ленингр.отд-ние', '300a': '103с', '900a': ''}, {'id': 20079, '100a': 'Побединский, Г. Г.', '245a': 'Программирование геодезических задач на языке БЕЙСИК', '260b': 'Недра', '300a': '86с.', '900a': ''}]
    made_PDF(dk)